In [2]:
import pandas as pd

Q.1

Five functions of Pandas Library :

    1. head()
    2. tail()
    3. loc iloc
    4. groupby
    5. sort_values()

In [25]:
s = pd.DataFrame({
    'Id': [109, 108, 103, 104],
    'Name': ['Dev', 'Ram', 'Aniket', 'Sham'],
    'Address' : ['Dhule', 'Mumbai','Nashik', 'Thane']
})

s.head(2)

s.tail(3)

#Sorting according to id
s.sort_values(by='Id')

    Id    Name Address
2  103  Aniket  Nashik
3  104    Sham   Thane
1  108     Ram  Mumbai
0  109     Dev   Dhule

In [40]:
#loc - Column Name
s.loc[0:2, ['Id', 'Name']]
#iloc
s.iloc[0:3, [1,2]]

     Name Address
0     Dev   Dhule
1     Ram  Mumbai
2  Aniket  Nashik

In [30]:
#Groupby - calculating the avg speed of car and bike
s1 = pd.DataFrame({
    'Vehicle' : ['car', 'bike', 'car', 'bike'],
    'speed' : [180, 90, 210, 75]
})

s1.groupby('Vehicle').mean()

         speed
Vehicle
bike      82.5
car      195.0

Q.2

In [44]:
# Que. Reindex the dataframe start with 1 and increment by 2

#For Demonstration we have consider some data in the cloumns A, B, C
s = pd.DataFrame({
    'A' : [1,2,3,4,5],
    'B': [5,6,7,8,8],
    'C': [2,4,6,7,9]
})

def re_index(s):
    l = []
    for i in range(len(s)*2)[1 :len(s)*2 + 1 :2]:
        l.append(i)
    return s.set_index(pd.Index(l))

re_index(s)

   A  B  C
1  1  5  2
3  2  6  4
5  3  7  6
7  4  8  7
9  5  8  9

Q.3

In [ ]:
# Que. Calculating the sum of three values from the column 'Values'

def sum_values(df):
    return df['Values'][0:4].sum()
      
sum_values(df)

Q.4

In [ ]:
# Que. Create new column 'Word_Count' that contains no.of words in 'Text' Column

def new_column(df):
    df['Word_Count'] = df['Text'].apply(lambda x : len(x.split()))
    return df

new_column_column(df)

Q.5

DataFrame.size() : It gives the total elements as ( rows X columns )

DataFrame.shape() : It gives the toal rows and columns in tuple as (rows, columns)

Q.6

In [7]:
#function of pandas do we use to read an excel file

df = pd.read_excel('xyz.xlsx')

Q.7

In [ ]:
# Que. create new column 'Username' that contains name from 'Email' Column  
#'username@domain.com'

df['Username'] = df['Email'].apply(lambda x : x.split("@")[0])

Q.8

In [ ]:
def new_df(df):
    return df[(df['A'] > 5) & (df['B'] < 10)]

new_df(df)

Q.9

In [ ]:
s = df[['Values']]

def cal(s):
    return f"Mean : {list(s.mean())} Median : {list(s.median())} Std deviation : {list(s.std())}"

cal(s)

Q.10

In [ ]:
df['MovingAverage'] = df['Sales'].rolling(window=7).mean()

Q.11

In [55]:
d = pd.DataFrame({
    'date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04']
})

d['date'] = pd.to_datetime(d['date'])

def weekday(d):
    d['Weekday'] = d['date'].dt.strftime('%A')
    return d

weekday(d)

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday

Q.12

In [70]:
dt = pd.DataFrame({
    'date':['2023-01-02','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07','2023-01-08','2023-01-09','2023-01-10']
})

dt['date'] = pd.to_datetime(dt['date'])

def date_bet(dt):
    return dt[(dt['date'] > '2023-01-01') & (dt['date'] < '2023-01-10')]
 
date_bet(dt)

        date
0 2023-01-02
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
5 2023-01-06
6 2023-01-07
7 2023-01-08
8 2023-01-09

Q.12

To used the basic functions of pandas we nees import Pandas Library as follows

In [69]:
import pandas as pd